Revit 2026 API

# Transform2DGetInverse Method

---

Gets the inverse transformation of this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform2D GetInverse()
```
```vb
Public Function GetInverse As Transform2D
```
```cpp
public:
Transform2D^ GetInverse()
```
```fsharp
member GetInverse : unit -> Transform2D
```

#### Return Value

Transform2D

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This transformation is not conformal or invertible. |

The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace